#Generated by Fabric Compiler ( version 2021.1-SP7.1-NL <build 128400> ) at Thu Aug 15 14:40:40 2024

set_arch -family Logos -device PGL25G -speedgrade -6 -package MBG324
compile -top_module ad7606_csi
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
